importing libraries

In [1]:
import pandas as pd
import numpy as np

Loading Datasets

In [2]:
df=pd.read_excel('onedata.xlsx')
df.head()

   buyer  fruits  gender  value
0    ali   apple    male      2
1   noor   mango    male      3
2  wajid  orange  female      4
3  karim  banana    male      4

Using python get dummies function to do one hot encoder

In [3]:
pd.get_dummies(data=df,columns=['buyer','fruits','gender'],dtype=int)

,value,buyer_ali,buyer_karim,buyer_noor,buyer_wajid,fruits_apple,fruits_banana,fruits_mango,fruits_orange,gender_female,gender_male
0,2,1,0,0,0,1,0,0,0,0,1
1,3,0,0,1,0,0,0,1,0,0,1
2,4,0,0,0,1,0,0,0,1,1,0
3,4,0,1,0,0,0,1,0,0,0,1

using scikit learn to use onehotencoder

In [5]:
from sklearn.preprocessing import OneHotEncoder
ohe=OneHotEncoder(drop='first',dtype=int,sparse_output=False)

In [6]:
df_transformed=ohe.fit_transform(df[['buyer','fruits','gender']])

In [7]:
df_transformed

array([[0, 0, 0, 0, 0, 0, 1],
       [0, 1, 0, 0, 1, 0, 1],
       [0, 0, 1, 0, 0, 1, 0],
       [1, 0, 0, 1, 0, 0, 1]])

In [8]:
cols=ohe.get_feature_names_out()
pd.DataFrame(data=df_transformed,columns=cols)

,buyer_karim,buyer_noor,buyer_wajid,fruits_banana,fruits_mango,fruits_orange,gender_male
0,0,0,0,0,0,0,1
1,0,1,0,0,1,0,1
2,0,0,1,0,0,1,0
3,1,0,0,1,0,0,1